In [1]:
import pandas as pd
import numpy as np

In [5]:
data_path = "../data/dados_sensores_5000.parquet"
df = pd.read_parquet(data_path, engine="pyarrow")
df.head()

     empresa  energia_kwh  agua_m3  co2_emissoes      setor
0  Empresa_1      6397.10   296.58       1600.24   Educação
1  Empresa_2      2570.30   492.52        818.98      Saúde
2  Empresa_3      4166.20   158.67       2710.03      Saúde
3  Empresa_4      8781.75   211.74       2036.72   Educação
4  Empresa_5      7846.09    16.84       2179.03  Indústria

In [12]:
print("\nTipos de dados:")
display(df.dtypes)

Tipos de dados:

empresa          object
energia_kwh     float64
agua_m3         float64
co2_emissoes    float64
setor            object
dtype: object

In [6]:
print("\nEstatísticas descritivas:")
display(df.describe())

Estatísticas descritivas:

       energia_kwh      agua_m3  co2_emissoes
count  5000.000000  5000.000000   5000.000000
mean   4982.012088   254.591516   1507.816080
std    2821.081316   139.225517    849.554449
min     100.620000    10.120000     51.120000
25%    2581.745000   138.082500    774.130000
50%    4936.540000   250.895000   1492.695000
75%    7425.097500   373.512500   2258.457500
max    9993.800000   499.760000   2999.640000

In [9]:
print("\nNúmero de linhas e colunas:")
display(df.shape)

Número de linhas e colunas:

(5000, 5)

In [10]:
print("\nValores nulos por coluna:")
display(df.isnull().sum())

Valores nulos por coluna:

empresa         0
energia_kwh     0
agua_m3         0
co2_emissoes    0
setor           0
dtype: int64

In [13]:
for column in df.columns:
    print(f"Unique values in {column}: {df[column].unique()}")

Unique values in empresa: ['Empresa_1' 'Empresa_2' 'Empresa_3' ... 'Empresa_4998' 'Empresa_4999'
 'Empresa_5000']
Unique values in energia_kwh: [6397.1  2570.3  4166.2  ... 6026.83 7907.98 2915.18]
Unique values in agua_m3: [296.58 492.52 158.67 ... 485.5  137.64 450.52]
Unique values in co2_emissoes: [1600.24  818.98 2710.03 ... 2379.65 2309.93   63.5 ]
Unique values in setor: ['Educação' 'Saúde' 'Indústria' 'Alimentação' 'Serviços' 'Varejo']